In [1]:
#dependencies
import pandas as pd

In [2]:
#read in the spreadsheets
p_df = pd.read_excel('POV_Pivot_forjup_xlsx.xlsx')
p_df.head()

  Code      Country  ReportedYear  RatioValue
0  ABW        Aruba          1977         NaN
1  AFG  Afghanistan          1977         NaN
2  AGO       Angola          1977         NaN
3  ALB      Albania          1977         NaN
4  AND      Andorra          1977         NaN

In [3]:
i_df = pd.read_excel('income_forjup.xlsx')
i_df.head()

  Code Country  ReportedYear IncomeGroup
0  ABW   Aruba          1987           H
1  ABW   Aruba          1988           H
2  ABW   Aruba          1989           H
3  ABW   Aruba          1990           H
4  ABW   Aruba          1991          UM

In [7]:
#drop null values in pov
p_df.dropna(inplace=True)
p_df.shape

(1602, 4)

In [8]:
latest_pov = p_df.sort_values('ReportedYear').groupby('Code').tail(1)

In [11]:
latest_pov.head()

     Code              Country  ReportedYear  RatioValue
4200  TTO  Trinidad and Tobago          1992         3.4
4883  LCA            St. Lucia          1995        35.8
5777  TKM         Turkmenistan          1998        51.4
5636  GUY               Guyana          1998        14.0
6026  SUR             Suriname          1999        23.4

In [12]:
latest_pov.shape

(175, 4)

In [10]:
#export results to csv
latest_pov.to_csv('latest_pov.csv', index=False)

In [22]:
#merge the dfs matching the latest year
final = pd.merge(latest_pov, i_df, on=['Code','ReportedYear'], how='left')
print(final.shape)
final.head()

(175, 6)

,Code,Country_x,ReportedYear,RatioValue,Country_y,IncomeGroup
0,TTO,Trinidad and Tobago,1992,3.4,Trinidad and Tobago,UM
1,LCA,St. Lucia,1995,35.8,St. Lucia,UM
2,TKM,Turkmenistan,1998,51.4,Turkmenistan,L
3,GUY,Guyana,1998,14.0,Guyana,LM
4,SUR,Suriname,1999,23.4,Suriname,LM

In [24]:
#drop unneeded rows
final = final[['Country_x', 'ReportedYear', 'RatioValue', 'IncomeGroup']]
final.head()

             Country_x  ReportedYear  RatioValue IncomeGroup
0  Trinidad and Tobago          1992         3.4          UM
1            St. Lucia          1995        35.8          UM
2         Turkmenistan          1998        51.4           L
3               Guyana          1998        14.0          LM
4             Suriname          1999        23.4          LM

In [20]:
#export to csv
final.to_csv('final.csv', index=False)